; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/childsnack/domain.pddl
;; updates:
;;   - :equality removed
;;   - :negative-preconditions added
;;   - action move_tray has a new precondition: (not (at ?t ?p2))

(define (domain childsnack)
(:requirements :typing :negative-preconditions)
(:types child bread-portion content-portion sandwich tray place)
(:constants kitchen - place)

(:predicates
    (at_kitchen_bread ?b - bread-portion)
	(at_kitchen_content ?c - content-portion)
    (at_kitchen_sandwich ?s - sandwich)
    (no_gluten_bread ?b - bread-portion)
    (no_gluten_content ?c - content-portion)
    (ontray ?s - sandwich ?t - tray)
    (no_gluten_sandwich ?s - sandwich)
	(allergic_gluten ?c - child)
    (not_allergic_gluten ?c - child)
	(served ?c - child)
	(waiting ?c - child ?p - place)
    (at ?t - tray ?p - place)
	(notexist ?s - sandwich)
)

(:action make_sandwich_no_gluten
	 :parameters (?s - sandwich ?b - bread-portion ?c - content-portion)
	 :precondition (and
        (at_kitchen_bread ?b)
        (at_kitchen_content ?c)
        (no_gluten_bread ?b)
        (no_gluten_content ?c)
        (notexist ?s))
	 :effect (and
        (not (at_kitchen_bread ?b))
        (not (at_kitchen_content ?c))
        (at_kitchen_sandwich ?s)
        (no_gluten_sandwich ?s)
        (not (notexist ?s)))
)

(:action make_sandwich
	 :parameters (?s - sandwich ?b - bread-portion ?c - content-portion)
	 :precondition (and
        (at_kitchen_bread ?b)
        (at_kitchen_content ?c)
        (notexist ?s))
	 :effect (and
        (not (at_kitchen_bread ?b))
        (not (at_kitchen_content ?c))
        (at_kitchen_sandwich ?s)
        (not (notexist ?s)))
)

(:action put_on_tray
	 :parameters (?s - sandwich ?t - tray)
	 :precondition (and
        (at_kitchen_sandwich ?s)
        (at ?t kitchen))
	 :effect (and
        (not (at_kitchen_sandwich ?s))
        (ontray ?s ?t))
)

(:action serve_sandwich_no_gluten
 	:parameters (?s - sandwich ?c - child ?t - tray ?p - place)
	:precondition (and
        (allergic_gluten ?c)
        (ontray ?s ?t)
        (waiting ?c ?p)
        (no_gluten_sandwich ?s)
        (at ?t ?p))
	:effect (and
        (not (ontray ?s ?t))
        (served ?c))
)

(:action serve_sandwich
	:parameters (?s - sandwich ?c - child ?t - tray ?p - place)
	:precondition (and
        (not_allergic_gluten ?c)
        (waiting ?c ?p)
        (ontray ?s ?t)
        (at ?t ?p))
	:effect (and
        (not (ontray ?s ?t))
        (served ?c))
)

(:action move_tray
	 :parameters (?t - tray ?p1 ?p2 - place)
	 :precondition (and
        (at ?t ?p1)
        (not (at ?t ?p2)))
	 :effect (and
        (not (at ?t ?p1))
        (at ?t ?p2))
))

; problem
(define (problem childsnack-36)
 (:domain childsnack)
 (:objects 
    child1 child2 child3 child4 child5 - child
    tray1 - tray
    sandw1 sandw2 sandw3 sandw4 sandw5 sandw6 sandw7 - sandwich
    bread1 bread2 bread3 bread4 bread5 - bread-portion
    content1 content2 content3 content4 content5 - content-portion
    table1 table2 table3 - place
    )
 (:init 
    (at tray1 kitchen)
    (at_kitchen_bread bread1)
    (at_kitchen_bread bread2)
    (at_kitchen_bread bread3)
    (at_kitchen_bread bread4)
    (at_kitchen_bread bread5)
    (at_kitchen_content content1)
    (at_kitchen_content content2)
    (at_kitchen_content content3)
    (at_kitchen_content content4)
    (at_kitchen_content content5)
    (allergic_gluten child5)
    (not_allergic_gluten child2)
    (not_allergic_gluten child3)
    (not_allergic_gluten child1)
    (not_allergic_gluten child4)
    (no_gluten_bread bread3)
    (no_gluten_content content3)
    (waiting child5 table2)
    (waiting child2 table1)
    (waiting child3 table3)
    (waiting child1 table1)
    (waiting child4 table1)
    (notexist sandw1)
    (notexist sandw2)
    (notexist sandw3)
    (notexist sandw4)
    (notexist sandw5)
    (notexist sandw6)
    (notexist sandw7))
 (:goal (and 
(served child1)
(served child2)
(served child4)
))
)

; plan
1. (make_sandwich sandw2 bread1 content1)
   deleted: (at_kitchen_bread bread1) (at_kitchen_content content1) (notexist sandw2)
   added: (at_kitchen_sandwich sandw2)
   goals met: 0 of 3
2. (put_on_tray sandw2 tray1)
   deleted: (at_kitchen_sandwich sandw2)
   added: (ontray sandw2 tray1)
   goals met: 0 of 3
3. (make_sandwich sandw3 bread2 content2)
   deleted: (at_kitchen_bread bread2) (at_kitchen_content content2) (notexist sandw3)
   added: (at_kitchen_sandwich sandw3)
   goals met: 0 of 3
4. (put_on_tray sandw3 tray1)
   deleted: (at_kitchen_sandwich sandw3)
   added: (ontray sandw3 tray1)
   goals met: 0 of 3
5. (make_sandwich sandw4 bread4 content4)
   deleted: (at_kitchen_bread bread4) (at_kitchen_content content4) (notexist sandw4)
   added: (at_kitchen_sandwich sandw4)
   goals met: 0 of 3
6. (put_on_tray sandw4 tray1)
   deleted: (at_kitchen_sandwich sandw4)
   added: (ontray sandw4 tray1)
   goals met: 0 of 3
7. (move_tray tray1 kitchen table1)
   deleted: (at tray1 kitchen)
   added: (at tray1 table1)
   goals met: 0 of 3
8. (serve_sandwich sandw2 child1 tray1 table1)
   deleted: (ontray sandw2 tray1)
   added: (served child1)
   goals met: 1 of 3
9. (serve_sandwich sandw3 child2 tray1 table1)
   deleted: (ontray sandw3 tray1)
   added: (served child2)
   goals met: 2 of 3
10. (serve_sandwich sandw4 child4 tray1 table1)
   deleted: (ontray sandw4 tray1)
   added: (served child4)
   goals met: 3 of 3
